# IsCurveDriven Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementRecord..::..IsCurveDriven Method
ElementRecord Class See Also
---
Identifies if the element is curve driven.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsCurveDriven()
```

Visual Basic
---
```text
Public Function IsCurveDriven As Boolean
```

Visual C++
---
```text
public:
bool IsCurveDriven()
```

# ### Return Value
True if the element is curve driven.
# See Also
ElementRecord Class
Autodesk.Revit.DB Namespace